app/controllers/purchases_controller.rb

  def index
    @purchases = Purchase.all
---
SELECT "purchases".* FROM "purchases"

  def show
    @purchase = Purchase.find(params[:id])
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @purchase = Purchase.find(params[:id])
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @purchases = CSV.new(params[:purchase][:csv].read, headers: true, :col_sep => "\t")
      .to_a.map{|row|
        p = Purchase.create(count: row["purchase count"].to_i)
---
INSERT INTO "purchases" ("count", "created_at", "updated_at") VALUES (?, ?, ?)  [["count", 1], ["created_at", Sun, 06 Apr 2014 17:28:00 UTC +00:00], ["updated_at", Sun, 06 Apr 2014 17:28:00 UTC +00:00]]

  def update
    @purchase = Purchase.find(params[:id])
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @purchase = Purchase.find(params[:id])
    @purchase.destroy
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 1]]