app/controllers/purchasers_controller.rb

  def index
    @purchasers = Purchaser.all
---
SELECT "purchasers".* FROM "purchasers"

  def show
    @purchaser = Purchaser.find(params[:id])
---
SELECT "purchasers".* FROM "purchasers" WHERE "purchasers"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @purchaser = Purchaser.find(params[:id])
---
SELECT "purchasers".* FROM "purchasers" WHERE "purchasers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @purchaser = Purchaser.new(params[:purchaser])

    respond_to do |format|
      if @purchaser.save
---
INSERT INTO "purchasers" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 06 Apr 2014 19:06:51 UTC +00:00], ["name", "MyString"], ["updated_at", Sun, 06 Apr 2014 19:06:51 UTC +00:00]]

  def update
    @purchaser = Purchaser.find(params[:id])
---
SELECT "purchasers".* FROM "purchasers" WHERE "purchasers"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @purchaser = Purchaser.find(params[:id])
    @purchaser.destroy
---
SELECT "purchasers".* FROM "purchasers" WHERE "purchasers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "purchasers" WHERE "purchasers"."id" = ?  [["id", 1]]